tsung_files/workload_tests_08L.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true"/>
  </clients>
  
  <!-- Server side setup -->
<servers>
  <server host="127.0.0.1" port="8000" type="tcp"></server>
</servers>

  <!-- to start os monitoring (cpu, network, memory). Use an erlang
  agent on the remote machine or SNMP. erlang is the default --> 
  <monitoring>
    <monitor host="127.0.0.1" type="snmp"></monitor>
  </monitoring>
  
  <load>
  <!-- several arrival phases can be set: for each phase, you can set
  the mean inter-arrival time between new clients and the phase
  duration -->
  <!--
   <arrivalphase phase="1" duration="30" unit="minute">
     <users maxnumber="1" interarrival="0.01" unit="second"></users>
   </arrivalphase>
  -->
   <!-- DIFFERENT WORKLOAD INTENSITIES-->
   <!-- 0.8L -->
    <arrivalphase phase="1" duration="30" unit="minute">
     <users interarrival="50.62421875" unit="second"></users>
    </arrivalphase>
   
  </load>

  <options>
   <option type="ts_http" name="user_agent">
    <user_agent probability="80">Mozilla/5.0 (X11; U; Linux i686; en-US; rv:1.7.8) Gecko/20050513 Galeon/1.3.21</user_agent>
    <user_agent probability="20">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
   </option>
  </options>

  <!-- start a session for a http user. the probability is the
  frequency of this type os session. The sum of all session's
  probabilities must be 100 -->

 <sessions>
  <session name="http-example" probability="100" type="ts_http">

    <!-- full url with server name, this overrides the "server" config value -->
  <!--  
    <for from="1" to="1000" incr="1" var="counter">
      <transaction name="req">
        <thinktime value="0.01"></thinktime>
        <request> <http url="/flight_counter?ORIGIN_CITY_NAME=Chicago,%20IL&amp;DEST_CITY_NAME=Springfield,%20MO&amp;INITIAL_DATE=2010-01-20&amp;FINAL_DATE=2011-01-20" method="GET" version="1.1" ></http> </request>
      </transaction>
    </for>
  -->

    
    <request> <http url="/flight_counter?ORIGIN_CITY_NAME=Chicago,%20IL&amp;DEST_CITY_NAME=Springfield,%20MO&amp;INITIAL_DATE=2010-01-20&amp;FINAL_DATE=2011-01-20" method="GET" version="1.1" ></http> </request>
    

  </session>
 </sessions>
</tsung>